### 📖 Terraform Plan (infra/resources/prod) - success
<details>
<summary>Show Plan</summary>

```hcl
  # module.web_apps.azurerm_role_assignment.services_cosmosdb_account_api["629dd380-fa50-4fad-974f-0a483b997683"] will be created
  + resource "azurerm_role_assignment" "services_cosmosdb_account_api" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "629dd380-fa50-4fad-974f-0a483b997683"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "SQL DB Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps.azurerm_role_assignment.services_cosmosdb_account_api["6a257f9d-2fd9-4f5c-9730-d6ec3dd39a93"] will be created
  + resource "azurerm_role_assignment" "services_cosmosdb_account_api" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6a257f9d-2fd9-4f5c-9730-d6ec3dd39a93"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "SQL DB Contributor"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-rg-internal/providers/Microsoft.DocumentDB/databaseAccounts/io-p-cosmos-api"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps.azurerm_role_assignment.services_key_vault_secrets_user will be created
  + resource "azurerm_role_assignment" "services_key_vault_secrets_user" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "629dd380-fa50-4fad-974f-0a483b997683"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-com-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps.azurerm_role_assignment.services_slot_key_vault_secrets_user will be created
  + resource "azurerm_role_assignment" "services_slot_key_vault_secrets_user" {
      + condition_version                = (known after apply)
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "6a257f9d-2fd9-4f5c-9730-d6ec3dd39a93"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Key Vault Secrets User"
      + scope                            = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.KeyVault/vaults/io-p-itn-com-kv-01"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.web_apps.module.services_func.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/sites/io-p-itn-com-services-func-01"
        name                                           = "io-p-itn-com-services-func-01"
        tags                                           = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "1.0.1"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (34 unchanged attributes hidden)

      ~ sticky_settings {
          ~ app_setting_names       = [
                # (6 unchanged elements hidden)
                "AzureFunctionsJobHost__logging__applicationInsights__samplingSettings__initialSamplingPercentage",
              + "AzureWebJobs.CreateNotification.Disabled",
              + "AzureWebJobs.EmailNotification.Disabled",
              + "AzureWebJobs.OnFailedProcessMessage.Disabled",
              + "AzureWebJobs.ProcessMessage.Disabled",
              + "AzureWebJobs.WebhookNotification.Disabled",
            ]
            # (1 unchanged attribute hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.web_apps.module.services_func.azurerm_linux_function_app_slot.this[0] will be updated in-place
  ~ resource "azurerm_linux_function_app_slot" "this" {
      ~ app_settings                                   = {
          ~ "AzureWebJobs.CreateNotification.Disabled"                                                         = "0" -> "1"
          ~ "AzureWebJobs.EmailNotification.Disabled"                                                          = "0" -> "1"
          ~ "AzureWebJobs.OnFailedProcessMessage.Disabled"                                                     = "0" -> "1"
          ~ "AzureWebJobs.ProcessMessage.Disabled"                                                             = "0" -> "1"
          ~ "AzureWebJobs.WebhookNotification.Disabled"                                                        = "0" -> "1"
            # (47 unchanged elements hidden)
        }
        id                                             = "/subscriptions/ec285037-c673-4f58-b594-d7c480da4e8b/resourceGroups/io-p-itn-com-rg-01/providers/Microsoft.Web/sites/io-p-itn-com-services-func-01/slots/staging"
        name                                           = "staging"
        tags                                           = {
            "BusinessUnit"   = "App IO"
            "CostCenter"     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"      = "Terraform"
            "Environment"    = "Prod"
            "ManagementTeam" = "IO Comunicazione"
            "ModuleName"     = "azure_function_app"
            "ModuleSource"   = "DX"
            "ModuleVersion"  = "1.0.1"
            "Source"         = "https://github.com/pagopa/io-messages/blob/main/infra/resources/prod"
        }
        # (31 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 4 to add, 2 to change, 0 to destroy.
```

</details>
